In [35]:
import pandas as pd
import numpy as np

In [36]:
#import dataset
data = pd.read_csv("data/KFF.csv")
data.head()

,Location,Average Lowest-Cost Bronze Premium,Average Lowest-Cost Silver Premium,Average Benchmark Premium,Average Lowest-Cost Gold Premium
0,United States,$364,$468,$477,$488
1,Alabama,$408,$563,$564,$637
2,Alaska,$533,$870,$889,$791
3,Arizona,$329,$373,$403,$475
4,Arkansas,$374,$424,$424,$509

In [37]:
#check data types of all columns
print(data.dtypes)

Location                              object
Average Lowest-Cost Bronze Premium    object
Average Lowest-Cost Silver Premium    object
Average Benchmark Premium             object
Average Lowest-Cost Gold Premium      object
dtype: object

In [38]:
#remove $ from cols
for column in range(1,5):
    data.iloc[:, column] = data.iloc[:, column].replace('[\$,]', '', regex=True).astype(float)

data.head()

,Location,Average Lowest-Cost Bronze Premium,Average Lowest-Cost Silver Premium,Average Benchmark Premium,Average Lowest-Cost Gold Premium
0,United States,364.0,468.0,477.0,488.0
1,Alabama,408.0,563.0,564.0,637.0
2,Alaska,533.0,870.0,889.0,791.0
3,Arizona,329.0,373.0,403.0,475.0
4,Arkansas,374.0,424.0,424.0,509.0

In [40]:
data.to_csv("data/cleaned_kff.csv", index=False)